{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"input_76": {"name": "input_76:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "1"}]}}}, "outputs": {"dense_227": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/dense_225/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/dense_225/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/dense_226/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/dense_226/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/dense_227/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/dense_227/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_76", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/Shape", "op": "Shape", "input": ["input_76"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/transpose", "op": "Transpose", "input": ["input_76", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_28", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_80"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_81"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_82"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_74"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_25", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_72"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/Shape", "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice/stack", "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice/stack_1", "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_28", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_75"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/strided_slice", "StatefulPartitionedCall/sequential_75/lstm_75/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/strided_slice", "StatefulPartitionedCall/sequential_75/lstm_75/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/zeros_1/packed", "StatefulPartitionedCall/sequential_75/lstm_75/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/zeros/packed", "StatefulPartitionedCall/sequential_75/lstm_75/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF83NS9sc3RtXzc1L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_78"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_77"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_76"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/cond/_23/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_42", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/cond/_23/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_14_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_15_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_13_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_16_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_17_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/time_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_counter_switch/_48", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_36", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1_switch/_51", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_39", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/LoopCond/_47"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_counter_switch/_48:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/exit/_63", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1_switch/_51"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_55:1", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_80", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_15_switch/_56:1", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_81", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_16_switch/_57:1", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_13_switch/_52:1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_16_switch/_57:1", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_17_switch/_58:1", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_switch/_54:1", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/exit/_63", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_55:1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/time_switch/_50:1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/time_switch/_50:1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_counter_switch/_48:1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_15_switch/_56:1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/MatMul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_2", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_72", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_3", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_75/dense_225/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/sequential_75/dense_225/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_75/dense_225/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_17_switch/_58:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/dense_226/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_75/dense_225/Relu", "StatefulPartitionedCall/sequential_75/dense_226/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_75/dense_226/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/split/split_dim", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/dense_227/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_75/dense_226/Relu", "StatefulPartitionedCall/sequential_75/dense_227/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_75/dense_227/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_75/dense_227/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Sigmoid_1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/input/_14_switch/_53:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Sigmoid", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/mul", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_1", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Sigmoid_2", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/mul_2", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1_switch/_51:1", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Write/TensorListSetItem/index", "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/next_iteration/_75", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_body_control/_59"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2_1/num_elements", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/Read/ReadVariableOp", "shape": [1, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/Read_1/ReadVariableOp", "shape": [64, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/Read_2/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/dense_225/MatMul/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/dense_225/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/dense_226/MatMul/ReadVariableOp", "shape": [32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/dense_226/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/dense_227/MatMul/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/dense_227/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Write/TensorListSetItem/index", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_75/lstm_75/PartitionedCall/while/body/_24/while/add_3/y", "shape": [], "dtype": "int32"}]}]}